name: "m1and2_ensemble"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "ensemble_input_string"
    data_type: TYPE_STRING
    dims: [-1]
  },
  {
    name: "ensemble_input_UINT8_array"
    data_type: TYPE_UINT8
    dims: [-1]
  },
  {
    name: "ensemble_input_INT8_array"
    data_type: TYPE_INT8
    dims: [-1]
  },
  {
    name: "ensemble_input_FP32_image"
    data_type: TYPE_FP32
    dims: [-1, -1, -1]
  },
  {
    name: "ensemble_input_bool"
    data_type: TYPE_BOOL
    dims: [-1]
  }
]
output [
  {
    name: "ensemble_output_string"
    data_type: TYPE_STRING
    dims: [-1]
  },
  {
    name: "ensemble_output_UINT8_array"
    data_type: TYPE_UINT8
    dims: [-1]
  },
  {
    name: "ensemble_output_INT8_array"
    data_type: TYPE_INT8
    dims: [-1]
  },
  {
    name: "ensemble_output_FP32_image"
    data_type: TYPE_FP32
    dims: [-1, -1, -1]
  },
  {
    name: "ensemble_output_bool"
    data_type: TYPE_BOOL
    dims: [-1]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "model1_python"
      model_version: -1
      input_map {
        key: "model_1_input_string"
        value: "ensemble_input_string"
      },
      input_map {
        key: "model_1_input_UINT8_array"
        value: "ensemble_input_UINT8_array"
      },
      input_map {
        key: "model_1_input_INT8_array"
        value: "ensemble_input_INT8_array"
      },
      input_map {
        key: "model_1_input_FP32_image"
        value: "ensemble_input_FP32_image"
      },
      input_map {
        key: "model_1_input_bool"
        value: "ensemble_input_bool"
      }
      output_map {
        key: "model_1_output_string"
        value: "model1_to_model2_string"
      },
      output_map {
        key: "model_1_output_UINT8_array"
        value: "model1_to_model2_UINT8_array"
      },
      output_map {
        key: "model_1_output_INT8_array"
        value: "model1_to_model2_INT8_array"
      },
      output_map {
        key: "model_1_output_FP32_image"
        value: "model1_to_model2_FP32_image"
      },
      output_map {
        key: "model_1_output_bool"
        value: "model1_to_model2_bool"
      }
    },
    {
      model_name: "model2_python"
      model_version: -1
      input_map {
        key: "model_2_input_string"
        value: "model1_to_model2_string"
      },
      input_map {
        key: "model_2_input_UINT8_array"
        value: "model1_to_model2_UINT8_array"
      },
      input_map {
        key: "model_2_input_INT8_array"
        value: "model1_to_model2_INT8_array"
      },
      input_map {
        key: "model_2_input_FP32_image"
        value: "model1_to_model2_FP32_image"
      },
      input_map {
        key: "model_2_input_bool"
        value: "model1_to_model2_bool"
      }
      output_map {
        key: "model_2_output_string"
        value: "ensemble_output_string"
      },
      output_map {
        key: "model_2_output_UINT8_array"
        value: "ensemble_output_UINT8_array"
      },
      output_map {
        key: "model_2_output_INT8_array"
        value: "ensemble_output_INT8_array"
      },
      output_map {
        key: "model_2_output_FP32_image"
        value: "ensemble_output_FP32_image"
      },
      output_map {
        key: "model_2_output_bool"
        value: "ensemble_output_bool"
      }
    }
  ]
}