name: "minimal_priority_ratelimiter_python_ensemble"
platform: "ensemble"

input [
  {
    name: "INPUT0"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]
ensemble_scheduling {
  step [
    {
        model_name: "minimal_priority_ratelimiter_python"
        model_version: -1
        input_map {
          key: "INPUT0"
          value: "INPUT0"
        }
        output_map {
          key: "OUTPUT0"
          value: "OUTPUT0"
        }
    }
  ]
}